# CLI tools
brew "fzf"
brew "fd"
brew "bat"
brew "git-delta"
brew "ripgrep"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "tmux"
brew "neovim"
brew "stow"
brew "btop"
brew "gh"
brew "mole"
brew "ffmpeg"
brew "docker"
brew "docker-compose"
brew "colima"
brew "age"

# GUI applications
cask "ghostty"
cask "nikitabobko/tap/aerospace"
cask "leader-key"
cask "1password-cli"
cask "xykong/tap/flux-markdown"
